Revit 2027 API
ElectricalSystem.StartSlot Property
 The Start Slot where the Electrical System is located in its panel.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int StartSlot { get; }
Public ReadOnly Property StartSlot As Integer
	Get
public:
property int StartSlot {
	int get ();
}
member StartSlot : int with get
Property Value
Int32
Remarks
 This property is used to retrieve the Start Slot of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace